# 파이썬에서 프로그램의 핵심을 main.py라고 생각해요
#


# 에디터 : 


# 파이썬 : 언어로 컴퓨터가 실행할 명령어 만드는 것 -> 코딩, 프로그래밍

# 텍스트파일 .txt
# pdf파일은 .pdf
# 이미지파일은 .png, .jpg

# python

# 파이썬 파일 .py
# 자바스크립트 파일.js


# 실행파일
print('hello world!!!')

'''
파이썬

데이터타입
1. 숫자 Number
2. 문자열 String
3. boolean 
-------------
4. 리스트 list [] list()
5. 딕셔너리 dictionary {} dict()
6. 튜플 tuple () tuple()
7. 집합 set {}, set()


조건문
if 조건1:
  (들여쓰기) 너무너무 중요하다
elif 조건2:
  (들여쓰기) 너무너무 중요하다
else:


반복문
for ~(반복에사용할 변수이름)~ in ~(반복할 조건,range(숫자), 리스트, 딕셔너리, 튜플, 집합 )~:

- break 문
- continue 문

while문 : 조간만 배웁니다. => 어려운문제


함수
1. 정의단계
def 이름(매개변수: 입력 데이터값의 변수 이름):

2. 호출단계
이름(인수: 실제 입력 데이터값)


'''

